{
    "updateText": "edict: The 7th Edict - A Grand Refinement and Strengthening of the Realm’s API",
    "description": "Lords, ladies, and esteemed users of the MonkeyBytes-API, gather round! A momentous decree has been issued, detailing the grand advancements bestowed upon our most noble API. This proclamation doth declare the following:\n\n- **Enrichment of the `/testing` Pathway**: Verily, the `/testing` route hath been blessed with new wonders! No longer do users receive mere trivialities—now, each request unveils a random tale of felines, drawn from the revered *CatFact Ninja*. Alongside these curious facts, thou shalt witness randomized images of our majestic companions, retrieved from the sacred Cat API. And shouldst thou seek a bot name worthy of kings and queens, the server shall bestow upon thee a name, fit for a digital noble, drawn from the very essence of the realm itself!\n\n- **Augmented Discord Webhook and Reddit Missives**: The kingdom's messengers now carry missives from the far-off lands of Reddit with even greater pomp and circumstance. Every five minutes, the top five posts from the hallowed pages of `/r/all` and `/r/discordapp` are delivered directly to Discord, with no fear of redundancy or confusion. Each proclamation arrives in full glory, adorned with titles, links, authors, and images, ensuring the court's delight in every new tale. Rejoice, for the formatting is flawless, and the service is swift and precise.\n\n- **Server Metrics Revealed in the Grand Hall**: Upon entering the noble root (`/`) endpoint, thou shalt now behold the state of the kingdom’s server itself! Be it uptime, date, or the sacred UK time, all is revealed to thee in an ever-updating display. Fear not, for the server now speaks to thee in real-time, displaying its strength and steadfastness through hours, minutes, and seconds, proving its unwavering service to the realm.\n\n- **Unyielding Security Fortifications**: The realm’s defenses have been bolstered with the latest innovations of our masterful engineers. Helmet, a steadfast sentinel, hath been employed to fortify our headers and repel any and all invaders. Thus, the walls of MonkeyBytes-API stand tall, keeping the realm’s citizens safe from the nefarious evildoers who lurk in the shadows of the digital world.\n\n- **Precision Logging by Our Faithful Scribe, Winston**: Each and every event that doth transpire is recorded by our loyal scribe, Winston, with unparalleled precision. From the grandest proclamations to the humblest requests, Winston’s quill doth not falter. All events are logged with colorful clarity, so that future generations may gaze upon them and know of the great deeds done within our realm.\n\n- **Stability and Grand Optimizations**: This release also brings forth a mighty refactoring of the realm’s foundations. Unused code hath been purged, dependencies have been trimmed, and performance hath been heightened to ensure the API runneth smooth as a well-oiled carriage. Thy server shall now operate with greater efficiency, handling all requests with the speed and grace befitting the royal court.\n\n- **Uptime Metrics and Time Display in Real-Time**: Behold the metrics of the server, live and ever-changing, presented in UK time. As thou dost enter the kingdom's grand root (`/`) hall, thou shalt witness the server's uptime measured in days, hours, minutes, and seconds. Let it be known throughout the realm that stability and time itself now stand in service to our noble users.\n\nThis release heralds a new era of stability, grandeur, and nobility within MonkeyBytes-API. Go forth, brave users, and explore the wonders this realm hath to offer. Long may the MonkeyBytes-API reign!",
    "footer": "The Seventh Edict"
  }
  